# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask"

# Binaries
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "postgresql"
brew "reattach-to-user-namespace"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"

# Apps
cask "1password"
cask "appcleaner"
cask "caffeine"
cask "docker"
cask "dropbox"
cask "flux"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "font-fira-code"
cask "imagealpha"
cask "imageoptim"
cask "plex-media-server"
cask "skitch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
